import all the necessary libraries

In [139]:
%matplotlib inline
import streamlit as st
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib
matplotlib.use('TkAgg') 
import matplotlib.pyplot as plt

read dataset

In [140]:
df = pd.read_csv("/Users/lissachaves/Documents/GitHub/TELLES_Python_portfolio/TidyData-Project/olympics_08_medalists.csv")

check dataset

In [141]:
df.head()

,medalist_name,male_archery,female_archery,male_athletics,female_athletics,male_badminton,female_badminton,male_baseball,male_basketball,female_basketball,...,female_beach volleyball,male_volleyball,female_volleyball,male_water polo,female_water polo,male_weightlifting,female_weightlifting,male_freestyle wrestling,female_freestyle wrestling,male_greco-roman wrestling
0,Aaron Armstrong,NaN,NaN,gold,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Aaron Peirsol,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Abdullo Tangriev,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Abeer Abdelrahman,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,bronze,NaN,NaN,NaN
4,Abhinav,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

reshape the dataframe, so we do not have to look at all the other sports

In [142]:
melted_df = pd.melt(df, id_vars=["medalist_name"], var_name='Sport', value_name='Medal')

deleting where 'Medal' is NaN because it means the athlete didn't win a medal in that sport

In [143]:
melted_df = melted_df.dropna(subset=['Medal'])
melted_df.head()

      medalist_name         Sport   Medal
177    Bair Badënov  male_archery  bronze
676   Ilario Di Buò  male_archery  silver
682    Im Dong-hyun  male_archery    gold
760       Jiang Lin  male_archery  bronze
920  Lee Chang-hwan  male_archery    gold

begin EDA

In [144]:
melted_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1875 entries, 177 to 131234
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   medalist_name  1875 non-null   object
 1   Sport          1875 non-null   object
 2   Medal          1875 non-null   object
dtypes: object(3)
memory usage: 58.6+ KB

In [145]:
melted_df.describe()

       medalist_name           Sport   Medal
count           1875            1875    1875
unique          1875              70       3
top     Bair Badënov  male_athletics  bronze
freq               1              85     668

In [146]:
melted_df.isnull().sum()

medalist_name    0
Sport            0
Medal            0
dtype: int64

In [149]:
sport_medal_df = pd.crosstab(melted_df['Sport'], melted_df['Medal'])
sport_medal_df.head()

Medal                        bronze  gold  silver
Sport
female_archery                    4     2       3
female_artistic gymnastics        7     7       6
female_association football      18    18      18
female_athletics                 26    27      28
female_badminton                  3     3       4

make plot

In [ ]:
sns.heatmap(sport_medal_df)
plt.savefig("p1heatmap.png")

make subsection used for graph to avoid having a graph with too much information

In [147]:
medals_per_athlete = melted_df.groupby('medalist_name')['Medal'].count().sort_values(ascending=True)
medals_per_athlete.head(10)

medalist_name
Aaron Armstrong        1
Novak Djokovic         1
Nova Widianto          1
Norman Bröckl          1
Norge Luis Vera        1
Norberto González      1
Norbert Madaras        1
Norbert Hosnyánszky    1
Noel Barrionuevo       1
Noeki Klein            1
Name: Medal, dtype: int64

make plot

In [148]:
medals_per_athlete.head(10).plot(kind='bar')
plt.title('Top 10 Athletes by Number of Medals')
plt.bar("medalist_name", "Medal")
plt.savefig('p2barplot.png')